{
 "cells": [
  {
   "cell_type": "code",
   "id": "initial_id",
   "metadata": {
    "collapsed": true,
    "ExecuteTime": {
     "end_time": "2025-04-20T00:57:54.098518Z",
     "start_time": "2025-04-20T00:57:54.085673Z"
    }
   },
   "source": [
    "from dotenv import load_dotenv\n",
    "import os\n",
    "\n",
    "env_file = '.env'\n",
    "if os.path.exists(env_file):\n",
    "    load_dotenv(env_file, override=True)\n",
    "\n",
    "    HOST = os.getenv('NEO4J_URI')\n",
    "    USERNAME = os.getenv('NEO4J_USERNAME')\n",
    "    PASSWORD = os.getenv('NEO4J_PASSWORD')\n",
    "\n",
    "else:\n",
    "    print(f\"File {env_file} not found.\")"
   ],
   "outputs": [],
   "execution_count": 1
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-04-20T00:57:55.701789Z",
     "start_time": "2025-04-20T00:57:55.000482Z"
    }
   },
   "cell_type": "code",
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "driver = GraphDatabase.driver(HOST, auth=(USERNAME, PASSWORD))"
   ],
   "id": "3a30b9a9ba9b4a98",
   "outputs": [],
   "execution_count": 2
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-04-20T00:57:57.150348Z",
     "start_time": "2025-04-20T00:57:57.147938Z"
    }
   },
   "cell_type": "code",
   "source": [
    "import os\n",
    "\n",
    "os.makedirs(\"source-csvs\", exist_ok=True)"
   ],
   "id": "c7fe9f3091783789",
   "outputs": [],
   "execution_count": 3
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "%pip install --upgrade google-cloud-bigquery",
   "id": "9d3a3539cdc53dca"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-04-20T01:02:16.895622Z",
     "start_time": "2025-04-20T01:02:09.007026Z"
    }
   },
   "cell_type": "code",
   "source": "!gcloud auth application-default login > /dev/null 2>&1",
   "id": "1f1881cb74698d0d",
   "outputs": [],
   "execution_count": 10
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-04-20T01:02:22.576746Z",
     "start_time": "2025-04-20T01:02:21.606822Z"
    }
   },
   "cell_type": "code",
   "source": [
    "import datetime\n",
    "\n",
    "from google.cloud import bigquery\n",
    "import pandas\n",
    "import pytz\n",
    "\n",
    "# Construct a BigQuery client object.\n",
    "client = bigquery.Client()\n",
    "\n",
    "bq_data_id = \"neo4jeventdemos.bomv1\""
   ],
   "id": "a4cf633091051c2e",
   "outputs": [],
   "execution_count": 11
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-04-20T01:02:53.093414Z",
     "start_time": "2025-04-20T01:02:52.653407Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Construct a full Dataset object to send to the API.\n",
    "dataset = bigquery.Dataset(bq_data_id)\n",
    "\n",
    "# TODO(developer): Specify the geographic location where the dataset should reside.\n",
    "dataset.location = \"US\"\n",
    "\n",
    "# Send the dataset to the API for creation, with an explicit timeout.\n",
    "# Raises google.api_core.exceptions.Conflict if the Dataset already\n",
    "# exists within the project.\n",
    "dataset = client.create_dataset(dataset, exists_ok=True, timeout=30)  # Make an API request.\n",
    "print(\"Created dataset {}.{}\".format(client.project, dataset.dataset_id))"
   ],
   "id": "a1dd66e604639d6e",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Created dataset neo4jeventdemos.bomv1\n"
     ]
    }
   ],
   "execution_count": 13
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-04-20T01:03:00.904069Z",
     "start_time": "2025-04-20T01:02:59.132213Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Suppliers\n",
    "res_df = driver.execute_query(\"\"\"\n",
    "MATCH (s:Supplier)\n",
    "OPTIONAL MATCH (s)-[:LOCATED_AT]->(l)\n",
    "    RETURN s.code AS code,\n",
    "        s.ANNUAL_SPEND AS annual_spend,\n",
    "        s.type AS tier,\n",
    "        s.sub_type AS sub_type,\n",
    "        s.category AS category,\n",
    "        l.latitude AS latitude,\n",
    "        l.longitude AS longitude\n",
    "\"\"\", result_transformer_= lambda r: r.to_df())\n",
    "res_df.to_csv('source-csvs/suppliers.csv', index=False)\n",
    "res_df"
   ],
   "id": "d3f087886f0c01c5",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "         code  annual_spend   tier sub_type category   latitude  longitude\n",
       "0      1BYKA5          0.00  Tier1     Manu     None -71.854680  71.681478\n",
       "1      0Q6W9M          0.00  Tier1   Direct     None -71.854680  71.681478\n",
       "2      U5TLHT    8056092.85  Tier1   Direct     None -71.854680  71.681478\n",
       "3      1QZ9ME          0.00  Tier1   Direct     None -71.854680  71.681478\n",
       "4      WH3ZVG       4801.61  Tier1   Direct     None -71.629455  70.897790\n",
       "...       ...           ...    ...      ...      ...        ...        ...\n",
       "13885  07XTEF          0.00  Tier1     Manu     None -68.723473  66.523889\n",
       "13886  P3OZZV      98107.83  Tier1   Direct     None -68.723473  66.523889\n",
       "13887  7PM532     643743.20  Tier1   Direct     None -71.930702  71.005756\n",
       "13888  ENEDNC       5453.94  Tier1   Direct     None -71.536288  71.746616\n",
       "13889  KVP039          0.00  Tier1   Direct     None -71.239374  69.595754\n",
       "\n",
       "[13890 rows x 7 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>code</th>\n",
       "      <th>annual_spend</th>\n",
       "      <th>tier</th>\n",
       "      <th>sub_type</th>\n",
       "      <th>category</th>\n",
       "      <th>latitude</th>\n",
       "      <th>longitude</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1BYKA5</td>\n",
       "      <td>0.00</td>\n",
       "      <td>Tier1</td>\n",
       "      <td>Manu</td>\n",
       "      <td>None</td>\n",
       "      <td>-71.854680</td>\n",
       "      <td>71.681478</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0Q6W9M</td>\n",
       "      <td>0.00</td>\n",
       "      <td>Tier1</td>\n",
       "      <td>Direct</td>\n",
       "      <td>None</td>\n",
       "      <td>-71.854680</td>\n",
       "      <td>71.681478</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>U5TLHT</td>\n",
       "      <td>8056092.85</td>\n",
       "      <td>Tier1</td>\n",
       "      <td>Direct</td>\n",
       "      <td>None</td>\n",
       "      <td>-71.854680</td>\n",
       "      <td>71.681478</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1QZ9ME</td>\n",
       "      <td>0.00</td>\n",
       "      <td>Tier1</td>\n",
       "      <td>Direct</td>\n",
       "      <td>None</td>\n",
       "      <td>-71.854680</td>\n",
       "      <td>71.681478</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>WH3ZVG</td>\n",
       "      <td>4801.61</td>\n",
       "      <td>Tier1</td>\n",
       "      <td>Direct</td>\n",
       "      <td>None</td>\n",
       "      <td>-71.629455</td>\n",
       "      <td>70.897790</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13885</th>\n",
       "      <td>07XTEF</td>\n",
       "      <td>0.00</td>\n",
       "      <td>Tier1</td>\n",
       "      <td>Manu</td>\n",
       "      <td>None</td>\n",
       "      <td>-68.723473</td>\n",
       "      <td>66.523889</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13886</th>\n",
       "      <td>P3OZZV</td>\n",
       "      <td>98107.83</td>\n",
       "      <td>Tier1</td>\n",
       "      <td>Direct</td>\n",
       "      <td>None</td>\n",
       "      <td>-68.723473</td>\n",
       "      <td>66.523889</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13887</th>\n",
       "      <td>7PM532</td>\n",
       "      <td>643743.20</td>\n",
       "      <td>Tier1</td>\n",
       "      <td>Direct</td>\n",
       "      <td>None</td>\n",
       "      <td>-71.930702</td>\n",
       "      <td>71.005756</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13888</th>\n",
       "      <td>ENEDNC</td>\n",
       "      <td>5453.94</td>\n",
       "      <td>Tier1</td>\n",
       "      <td>Direct</td>\n",
       "      <td>None</td>\n",
       "      <td>-71.536288</td>\n",
       "      <td>71.746616</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13889</th>\n",
       "      <td>KVP039</td>\n",
       "      <td>0.00</td>\n",
       "      <td>Tier1</td>\n",
       "      <td>Direct</td>\n",
       "      <td>None</td>\n",
       "      <td>-71.239374</td>\n",
       "      <td>69.595754</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>13890 rows × 7 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 14
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-04-20T01:03:07.878742Z",
     "start_time": "2025-04-20T01:03:03.192694Z"
    }
   },
   "cell_type": "code",
   "source": [
    "job_config = bigquery.LoadJobConfig(\n",
    "    # BigQuery appends loaded rows\n",
    "    # to an existing table by default, but with WRITE_TRUNCATE write\n",
    "    # disposition it replaces the table with the loaded data.\n",
    "    write_disposition=\"WRITE_TRUNCATE\",\n",
    ")\n",
    "table_id = f\"{bq_data_id}.suppliers\"\n",
    "job = client.load_table_from_dataframe(\n",
    "    res_df, table_id, job_config=job_config\n",
    ")  # Make an API request.\n",
    "job.result()  # Wait for the job to complete."
   ],
   "id": "5da4239216044749",
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/zachblumenfeld/interpeters/graphrag-examples/lib/python3.9/site-packages/google/cloud/bigquery/_pandas_helpers.py:489: FutureWarning: Loading pandas DataFrame into BigQuery will require pandas-gbq package version 0.26.1 or greater in the future. Tried to import pandas-gbq and got: No module named 'pandas_gbq'\n",
      "  warnings.warn(\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "LoadJob<project=neo4jeventdemos, location=US, id=368b3984-eb92-4699-9fd8-cfb842cfa13a>"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 15
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-04-20T01:06:51.835829Z",
     "start_time": "2025-04-20T01:06:17.751428Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# SupplierItems\n",
    "print(\"Reading Data...\")\n",
    "res = driver.execute_query(\"\"\"\n",
    "MATCH (i:Product|Component)-[:AT]->(s:Supplier)\n",
    "    RETURN s.code AS supplier_code,\n",
    "        i.skuId AS sku_id\n",
    "\"\"\", result_transformer_= lambda r: r.to_df())\n",
    "print(\"Writing CSV...\")\n",
    "res.to_csv('source-csvs/supplier-items.csv', index=False)\n",
    "print(\"Writing to BigQuery...\")\n",
    "table_id = f\"{bq_data_id}.supplier_items\"\n",
    "job = client.load_table_from_dataframe(\n",
    "    res, table_id, job_config=job_config\n",
    ")\n",
    "job.result()\n",
    "res"
   ],
   "id": "c4ad052776a07abd",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Reading Data...\n",
      "Writing CSV...\n",
      "Writing to BigQuery...\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/zachblumenfeld/interpeters/graphrag-examples/lib/python3.9/site-packages/google/cloud/bigquery/_pandas_helpers.py:489: FutureWarning: Loading pandas DataFrame into BigQuery will require pandas-gbq package version 0.26.1 or greater in the future. Tried to import pandas-gbq and got: No module named 'pandas_gbq'\n",
      "  warnings.warn(\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "       supplier_code    sku_id\n",
       "0             1BYKA5  28044675\n",
       "1             1BYKA5  28025519\n",
       "2             U5TLHT  28612413\n",
       "3             U5TLHT  28131814\n",
       "4             U5TLHT  28712502\n",
       "...              ...       ...\n",
       "482406        7PM532  28450613\n",
       "482407        ENEDNC   9397882\n",
       "482408        ENEDNC   9397882\n",
       "482409        KVP039  35158616\n",
       "482410        KVP039  35158616\n",
       "\n",
       "[482411 rows x 2 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>supplier_code</th>\n",
       "      <th>sku_id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1BYKA5</td>\n",
       "      <td>28044675</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1BYKA5</td>\n",
       "      <td>28025519</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>U5TLHT</td>\n",
       "      <td>28612413</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>U5TLHT</td>\n",
       "      <td>28131814</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>U5TLHT</td>\n",
       "      <td>28712502</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>482406</th>\n",
       "      <td>7PM532</td>\n",
       "      <td>28450613</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>482407</th>\n",
       "      <td>ENEDNC</td>\n",
       "      <td>9397882</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>482408</th>\n",
       "      <td>ENEDNC</td>\n",
       "      <td>9397882</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>482409</th>\n",
       "      <td>KVP039</td>\n",
       "      <td>35158616</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>482410</th>\n",
       "      <td>KVP039</td>\n",
       "      <td>35158616</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>482411 rows × 2 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 16
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-04-20T01:15:04.972804Z",
     "start_time": "2025-04-20T01:14:45.116790Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Items\n",
    "print(\"Reading Data...\")\n",
    "res = driver.execute_query(\"\"\"\n",
    "MATCH (i:Product|Component)\n",
    "OPTIONAL MATCH (i)-[:GROUP_OF]->(g)\n",
    "RETURN i.skuId AS sku_id,\n",
    "    g.code AS group_code,\n",
    "    CASE labels(i)\n",
    "        WHEN ['Product'] THEN 'PRODUCT'\n",
    "        WHEN ['Component'] THEN 'COMPONENT'\n",
    "        ELSE 'PRODUCT_AND_COMPONENT'\n",
    "    END AS type,\n",
    "    i.MANUFACTURER AS manufacturer,\n",
    "    i.LIFECYCLE_STATUS AS lifecycle_status,\n",
    "    i.WAFER_PROCESS_NAME AS wafers_process_name,\n",
    "    i.MPN AS mpn,\n",
    "    i.WAFER_GEOMETRY AS wafers_geometry,\n",
    "    i.PACKAGE_METHOD AS package_method,\n",
    "    i.WAFER_DIAMETER AS wafers_diameter\n",
    "\"\"\", result_transformer_= lambda r: r.to_df())\n",
    "print(\"Writing CSV...\")\n",
    "res.to_csv('source-csvs/items.csv', index=False)\n",
    "print(\"Writing to BigQuery...\")\n",
    "table_id = f\"{bq_data_id}.items\"\n",
    "item_job_conf = bigquery.LoadJobConfig(\n",
    "    schema=[\n",
    "        bigquery.SchemaField(\"group_code\", bigquery.enums.SqlTypeNames.INTEGER),\n",
    "    ],\n",
    "    write_disposition=\"WRITE_TRUNCATE\",\n",
    ")\n",
    "job = client.load_table_from_dataframe(\n",
    "    res, table_id, job_config=item_job_conf\n",
    ")\n",
    "job.result()\n",
    "res"
   ],
   "id": "b0000b243084cd8a",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Reading Data...\n",
      "Writing CSV...\n",
      "Writing to BigQuery...\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/zachblumenfeld/interpeters/graphrag-examples/lib/python3.9/site-packages/google/cloud/bigquery/_pandas_helpers.py:489: FutureWarning: Loading pandas DataFrame into BigQuery will require pandas-gbq package version 0.26.1 or greater in the future. Tried to import pandas-gbq and got: No module named 'pandas_gbq'\n",
      "  warnings.warn(\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "          sku_id  group_code       type manufacturer lifecycle_status  \\\n",
       "0       12243661      1000.0  COMPONENT         None             None   \n",
       "1       28499719      1001.0  COMPONENT         None             None   \n",
       "2       28246025      1001.0  COMPONENT         None             None   \n",
       "3       28722634      1001.0  COMPONENT         None             None   \n",
       "4       28263736      1001.0  COMPONENT         None             None   \n",
       "...          ...         ...        ...          ...              ...   \n",
       "233604  25367709         NaN    PRODUCT         None             None   \n",
       "233605  25372957         NaN    PRODUCT         None             None   \n",
       "233606  28052594         NaN    PRODUCT         None             None   \n",
       "233607  28092207         NaN    PRODUCT         None             None   \n",
       "233608  28441313         NaN    PRODUCT         None             None   \n",
       "\n",
       "       wafers_process_name   mpn wafers_geometry package_method  \\\n",
       "0                     None  None            None           None   \n",
       "1                     None  None            None           None   \n",
       "2                     None  None            None           None   \n",
       "3                     None  None            None           None   \n",
       "4                     None  None            None           None   \n",
       "...                    ...   ...             ...            ...   \n",
       "233604                None  None            None           None   \n",
       "233605                None  None            None           None   \n",
       "233606                None  None            None           None   \n",
       "233607                None  None            None           None   \n",
       "233608                None  None            None           None   \n",
       "\n",
       "       wafers_diameter  \n",
       "0                 None  \n",
       "1                 None  \n",
       "2                 None  \n",
       "3                 None  \n",
       "4                 None  \n",
       "...                ...  \n",
       "233604            None  \n",
       "233605            None  \n",
       "233606            None  \n",
       "233607            None  \n",
       "233608            None  \n",
       "\n",
       "[233609 rows x 10 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>sku_id</th>\n",
       "      <th>group_code</th>\n",
       "      <th>type</th>\n",
       "      <th>manufacturer</th>\n",
       "      <th>lifecycle_status</th>\n",
       "      <th>wafers_process_name</th>\n",
       "      <th>mpn</th>\n",
       "      <th>wafers_geometry</th>\n",
       "      <th>package_method</th>\n",
       "      <th>wafers_diameter</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>12243661</td>\n",
       "      <td>1000.0</td>\n",
       "      <td>COMPONENT</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>28499719</td>\n",
       "      <td>1001.0</td>\n",
       "      <td>COMPONENT</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>28246025</td>\n",
       "      <td>1001.0</td>\n",
       "      <td>COMPONENT</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>28722634</td>\n",
       "      <td>1001.0</td>\n",
       "      <td>COMPONENT</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>28263736</td>\n",
       "      <td>1001.0</td>\n",
       "      <td>COMPONENT</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>233604</th>\n",
       "      <td>25367709</td>\n",
       "      <td>NaN</td>\n",
       "      <td>PRODUCT</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>233605</th>\n",
       "      <td>25372957</td>\n",
       "      <td>NaN</td>\n",
       "      <td>PRODUCT</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>233606</th>\n",
       "      <td>28052594</td>\n",
       "      <td>NaN</td>\n",
       "      <td>PRODUCT</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>233607</th>\n",
       "      <td>28092207</td>\n",
       "      <td>NaN</td>\n",
       "      <td>PRODUCT</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>233608</th>\n",
       "      <td>28441313</td>\n",
       "      <td>NaN</td>\n",
       "      <td>PRODUCT</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>233609 rows × 10 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 19
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-04-20T01:24:52.579657Z",
     "start_time": "2025-04-20T01:17:24.477666Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# BOMTable\n",
    "print(\"Reading Data...\")\n",
    "res = driver.execute_query(\"\"\"\n",
    "MATCH (parent:Product|Component)-[:BOM]->(child)\n",
    "RETURN parent.skuId AS parent_sku_id,\n",
    "    child.skuId AS child_sku_id\n",
    "\"\"\", result_transformer_= lambda r: r.to_df())\n",
    "print(\"Writing CSV...\")\n",
    "res.to_csv('source-csvs/bom-table.csv', index=False)\n",
    "print(\"Writing to BigQuery...\")\n",
    "table_id = f\"{bq_data_id}.bom_table\"\n",
    "job = client.load_table_from_dataframe(\n",
    "    res, table_id, job_config=job_config\n",
    ")\n",
    "job.result()\n",
    "res"
   ],
   "id": "4870bf1fe223de7d",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Reading Data...\n",
      "Writing CSV...\n",
      "Writing to BigQuery...\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/zachblumenfeld/interpeters/graphrag-examples/lib/python3.9/site-packages/google/cloud/bigquery/_pandas_helpers.py:489: FutureWarning: Loading pandas DataFrame into BigQuery will require pandas-gbq package version 0.26.1 or greater in the future. Tried to import pandas-gbq and got: No module named 'pandas_gbq'\n",
      "  warnings.warn(\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "        parent_sku_id child_sku_id\n",
       "0            28722634  28824371-01\n",
       "1            28722634  28824362-01\n",
       "2            28722634  28755526-01\n",
       "3            28722634  28824361-01\n",
       "4            28722634  28809116-01\n",
       "...               ...          ...\n",
       "7478471      33116186     35119186\n",
       "7478472      13651156     35715222\n",
       "7478473      13651156     35715220\n",
       "7478474      13651156     35715221\n",
       "7478475      13651156     35715223\n",
       "\n",
       "[7478476 rows x 2 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>parent_sku_id</th>\n",
       "      <th>child_sku_id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>28722634</td>\n",
       "      <td>28824371-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>28722634</td>\n",
       "      <td>28824362-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>28722634</td>\n",
       "      <td>28755526-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>28722634</td>\n",
       "      <td>28824361-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>28722634</td>\n",
       "      <td>28809116-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7478471</th>\n",
       "      <td>33116186</td>\n",
       "      <td>35119186</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7478472</th>\n",
       "      <td>13651156</td>\n",
       "      <td>35715222</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7478473</th>\n",
       "      <td>13651156</td>\n",
       "      <td>35715220</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7478474</th>\n",
       "      <td>13651156</td>\n",
       "      <td>35715221</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7478475</th>\n",
       "      <td>13651156</td>\n",
       "      <td>35715223</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>7478476 rows × 2 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 20
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-04-20T01:25:25.141513Z",
     "start_time": "2025-04-20T01:25:20.919879Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# ComponentGroups\n",
    "print(\"Reading Data...\")\n",
    "res = driver.execute_query(\"\"\"\n",
    "MATCH path=(g:Group)-[:SUB_CAT]->(s)-[:CAT_OF]->(c)\n",
    "WHERE NOT (s.code STARTS WITH \"DL\" AND c.code = \"AW\") //throw out 2 odd cases\n",
    "WITH g.code AS code, nodes(collect(path)[0]) AS path_nodes //minority of multi-subcategories...just picking first one\n",
    "RETURN code, path_nodes[1].code AS sub_category,  path_nodes[2].code AS category\n",
    "\"\"\", result_transformer_= lambda r: r.to_df())\n",
    "print(\"Writing CSV...\")\n",
    "res.to_csv('source-csvs/component-groups.csv', index=False)\n",
    "print(\"Writing to BigQuery...\")\n",
    "table_id = f\"{bq_data_id}.component_groups\"\n",
    "group_job_conf = bigquery.LoadJobConfig(\n",
    "    schema=[\n",
    "        bigquery.SchemaField(\"code\", bigquery.enums.SqlTypeNames.INTEGER),\n",
    "    ],\n",
    "    write_disposition=\"WRITE_TRUNCATE\",\n",
    ")\n",
    "job = client.load_table_from_dataframe(\n",
    "    res, table_id, job_config=group_job_conf\n",
    ")\n",
    "job.result()\n",
    "res"
   ],
   "id": "58aa65dce7f8fb86",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Reading Data...\n",
      "Writing CSV...\n",
      "Writing to BigQuery...\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/zachblumenfeld/interpeters/graphrag-examples/lib/python3.9/site-packages/google/cloud/bigquery/_pandas_helpers.py:489: FutureWarning: Loading pandas DataFrame into BigQuery will require pandas-gbq package version 0.26.1 or greater in the future. Tried to import pandas-gbq and got: No module named 'pandas_gbq'\n",
      "  warnings.warn(\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "     code sub_category category\n",
       "0    1205      AW-0012       AW\n",
       "1    1212      AW-0010       AW\n",
       "2    1262      AW-0010       AW\n",
       "3    1150      AW-0010       AW\n",
       "4    1243      AW-0010       AW\n",
       "..    ...          ...      ...\n",
       "312  1103      HU-0013       HU\n",
       "313  1299      HU-0001       HU\n",
       "314  1296      HU-0000       HU\n",
       "315  1163      HU-0004       HU\n",
       "316  1086      HU-0003       HU\n",
       "\n",
       "[317 rows x 3 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>code</th>\n",
       "      <th>sub_category</th>\n",
       "      <th>category</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1205</td>\n",
       "      <td>AW-0012</td>\n",
       "      <td>AW</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1212</td>\n",
       "      <td>AW-0010</td>\n",
       "      <td>AW</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1262</td>\n",
       "      <td>AW-0010</td>\n",
       "      <td>AW</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1150</td>\n",
       "      <td>AW-0010</td>\n",
       "      <td>AW</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1243</td>\n",
       "      <td>AW-0010</td>\n",
       "      <td>AW</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>312</th>\n",
       "      <td>1103</td>\n",
       "      <td>HU-0013</td>\n",
       "      <td>HU</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>313</th>\n",
       "      <td>1299</td>\n",
       "      <td>HU-0001</td>\n",
       "      <td>HU</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>314</th>\n",
       "      <td>1296</td>\n",
       "      <td>HU-0000</td>\n",
       "      <td>HU</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>315</th>\n",
       "      <td>1163</td>\n",
       "      <td>HU-0004</td>\n",
       "      <td>HU</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>316</th>\n",
       "      <td>1086</td>\n",
       "      <td>HU-0003</td>\n",
       "      <td>HU</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>317 rows × 3 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 21
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-04-20T01:25:39.040715Z",
     "start_time": "2025-04-20T01:25:35.486516Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# CustomerFamilies\n",
    "print(\"Reading Data...\")\n",
    "res = driver.execute_query(\"\"\"\n",
    "MATCH (n:CustomerFamily)\n",
    "RETURN n.code AS code, n.ANNUAL_REVENUE AS annual_revenue\n",
    "\"\"\", result_transformer_= lambda r: r.to_df())\n",
    "print(\"Writing CSV...\")\n",
    "res.to_csv('source-csvs/customer-families.csv', index=False)\n",
    "print(\"Writing to BigQuery...\")\n",
    "table_id = f\"{bq_data_id}.customer_families\"\n",
    "job = client.load_table_from_dataframe(\n",
    "    res, table_id, job_config=job_config\n",
    ")\n",
    "job.result()\n",
    "res"
   ],
   "id": "3464e621b8aca44a",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Reading Data...\n",
      "Writing CSV...\n",
      "Writing to BigQuery...\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/zachblumenfeld/interpeters/graphrag-examples/lib/python3.9/site-packages/google/cloud/bigquery/_pandas_helpers.py:489: FutureWarning: Loading pandas DataFrame into BigQuery will require pandas-gbq package version 0.26.1 or greater in the future. Tried to import pandas-gbq and got: No module named 'pandas_gbq'\n",
      "  warnings.warn(\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "         code  annual_revenue\n",
       "0     ABJ6813     11022043.75\n",
       "1     ABO6097         1633.86\n",
       "2     ABT1245       160543.79\n",
       "3     ABU5981        61425.00\n",
       "4     ABW1783         8045.16\n",
       "...       ...             ...\n",
       "1159  GBW7820            0.00\n",
       "1160  GCI2943            0.00\n",
       "1161  GCJ9703            0.00\n",
       "1162  GCL7169            0.00\n",
       "1163  GCO4718            0.00\n",
       "\n",
       "[1164 rows x 2 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>code</th>\n",
       "      <th>annual_revenue</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ABJ6813</td>\n",
       "      <td>11022043.75</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ABO6097</td>\n",
       "      <td>1633.86</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ABT1245</td>\n",
       "      <td>160543.79</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ABU5981</td>\n",
       "      <td>61425.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ABW1783</td>\n",
       "      <td>8045.16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1159</th>\n",
       "      <td>GBW7820</td>\n",
       "      <td>0.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1160</th>\n",
       "      <td>GCI2943</td>\n",
       "      <td>0.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1161</th>\n",
       "      <td>GCJ9703</td>\n",
       "      <td>0.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1162</th>\n",
       "      <td>GCL7169</td>\n",
       "      <td>0.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1163</th>\n",
       "      <td>GCO4718</td>\n",
       "      <td>0.00</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1164 rows × 2 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 22
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-04-20T01:28:26.444072Z",
     "start_time": "2025-04-20T01:28:22.971852Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Customers\n",
    "print(\"Reading Data...\")\n",
    "res = driver.execute_query(\"\"\"\n",
    "MATCH (c:Customer)\n",
    "OPTIONAL MATCH (c)-[:LOCATED_AT]->(l)\n",
    "OPTIONAL MATCH (c)-[:PART_OF]->(customerFamily)\n",
    "    RETURN c.code AS code,\n",
    "        customerFamily.code AS cust_family_code,\n",
    "        c.ANNUAL_REVENUE AS annual_revenue,\n",
    "        l.latitude AS latitude,\n",
    "        l.longitude AS longitude\n",
    "\"\"\", result_transformer_= lambda r: r.to_df())\n",
    "print(\"Writing CSV...\")\n",
    "res.to_csv('source-csvs/customers.csv', index=False)\n",
    "print(\"Writing to BigQuery...\")\n",
    "table_id = f\"{bq_data_id}.customers\"\n",
    "customer_job_conf = bigquery.LoadJobConfig(\n",
    "    schema=[\n",
    "        bigquery.SchemaField(\"code\", bigquery.enums.SqlTypeNames.INTEGER),\n",
    "    ],\n",
    "    write_disposition=\"WRITE_TRUNCATE\",\n",
    ")\n",
    "job = client.load_table_from_dataframe(\n",
    "    res, table_id, job_config=customer_job_conf\n",
    ")\n",
    "job.result()\n",
    "res"
   ],
   "id": "bdaa984fece8396b",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Reading Data...\n",
      "Writing CSV...\n",
      "Writing to BigQuery...\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/zachblumenfeld/interpeters/graphrag-examples/lib/python3.9/site-packages/google/cloud/bigquery/_pandas_helpers.py:489: FutureWarning: Loading pandas DataFrame into BigQuery will require pandas-gbq package version 0.26.1 or greater in the future. Tried to import pandas-gbq and got: No module named 'pandas_gbq'\n",
      "  warnings.warn(\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "        code cust_family_code  annual_revenue   latitude   longitude\n",
       "0        241          FGK5621        62893.20  85.204849  115.270783\n",
       "1        276          EVM6571       626261.59  85.338050  115.387250\n",
       "2        293          FGK5621        22475.60  85.120131  116.282726\n",
       "3        433          FRO5891        50755.95  28.575001   -2.084160\n",
       "4        445          FRO5891        72740.80  28.575001   -2.084160\n",
       "...      ...              ...             ...        ...         ...\n",
       "5442  554363          BOR3941      3690230.40  26.231283   85.414119\n",
       "5443  554388          FPV1408      1436645.42  26.231283   85.414119\n",
       "5444  554452          FGK5621        16817.76  26.231283   85.414119\n",
       "5445  554523          FLZ4789      8340556.19  30.661761   91.304522\n",
       "5446  555066          BSF4591        98182.10  30.633035   91.266000\n",
       "\n",
       "[5447 rows x 5 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>code</th>\n",
       "      <th>cust_family_code</th>\n",
       "      <th>annual_revenue</th>\n",
       "      <th>latitude</th>\n",
       "      <th>longitude</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>241</td>\n",
       "      <td>FGK5621</td>\n",
       "      <td>62893.20</td>\n",
       "      <td>85.204849</td>\n",
       "      <td>115.270783</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>276</td>\n",
       "      <td>EVM6571</td>\n",
       "      <td>626261.59</td>\n",
       "      <td>85.338050</td>\n",
       "      <td>115.387250</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>293</td>\n",
       "      <td>FGK5621</td>\n",
       "      <td>22475.60</td>\n",
       "      <td>85.120131</td>\n",
       "      <td>116.282726</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>433</td>\n",
       "      <td>FRO5891</td>\n",
       "      <td>50755.95</td>\n",
       "      <td>28.575001</td>\n",
       "      <td>-2.084160</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>445</td>\n",
       "      <td>FRO5891</td>\n",
       "      <td>72740.80</td>\n",
       "      <td>28.575001</td>\n",
       "      <td>-2.084160</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5442</th>\n",
       "      <td>554363</td>\n",
       "      <td>BOR3941</td>\n",
       "      <td>3690230.40</td>\n",
       "      <td>26.231283</td>\n",
       "      <td>85.414119</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5443</th>\n",
       "      <td>554388</td>\n",
       "      <td>FPV1408</td>\n",
       "      <td>1436645.42</td>\n",
       "      <td>26.231283</td>\n",
       "      <td>85.414119</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5444</th>\n",
       "      <td>554452</td>\n",
       "      <td>FGK5621</td>\n",
       "      <td>16817.76</td>\n",
       "      <td>26.231283</td>\n",
       "      <td>85.414119</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5445</th>\n",
       "      <td>554523</td>\n",
       "      <td>FLZ4789</td>\n",
       "      <td>8340556.19</td>\n",
       "      <td>30.661761</td>\n",
       "      <td>91.304522</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5446</th>\n",
       "      <td>555066</td>\n",
       "      <td>BSF4591</td>\n",
       "      <td>98182.10</td>\n",
       "      <td>30.633035</td>\n",
       "      <td>91.266000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5447 rows × 5 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 23
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-04-20T01:31:11.150185Z",
     "start_time": "2025-04-20T01:30:28.783815Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# CustomerItems\n",
    "print(\"Reading Data...\")\n",
    "res = driver.execute_query(\"\"\"\n",
    "MATCH (i:Product|Component)-[:AT]->(c:Customer)\n",
    "    RETURN c.code AS customer_code,\n",
    "        i.skuId AS sku_id\n",
    "\"\"\", result_transformer_= lambda r: r.to_df())\n",
    "print(\"Writing CSV...\")\n",
    "res.to_csv('source-csvs/customer-items.csv', index=False)\n",
    "print(\"Writing to BigQuery...\")\n",
    "table_id = f\"{bq_data_id}.customer_items\"\n",
    "customer_item_job_conf = bigquery.LoadJobConfig(\n",
    "    schema=[\n",
    "        bigquery.SchemaField(\"customer_code\", bigquery.enums.SqlTypeNames.INTEGER),\n",
    "    ],\n",
    "    write_disposition=\"WRITE_TRUNCATE\",\n",
    ")\n",
    "job = client.load_table_from_dataframe(\n",
    "    res, table_id, job_config=customer_item_job_conf\n",
    ")\n",
    "job.result()\n",
    "res"
   ],
   "id": "ab3f636ada743eae",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Reading Data...\n",
      "Writing CSV...\n",
      "Writing to BigQuery...\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/zachblumenfeld/interpeters/graphrag-examples/lib/python3.9/site-packages/google/cloud/bigquery/_pandas_helpers.py:489: FutureWarning: Loading pandas DataFrame into BigQuery will require pandas-gbq package version 0.26.1 or greater in the future. Tried to import pandas-gbq and got: No module named 'pandas_gbq'\n",
      "  warnings.warn(\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "        customer_code       sku_id\n",
       "0                 241     10769880\n",
       "1                 241     10713430\n",
       "2                 241     10916001\n",
       "3                 241  DEC85280353\n",
       "4                 241     10769876\n",
       "...               ...          ...\n",
       "635805         554523     12191818\n",
       "635806         555066     10756526\n",
       "635807         555066     10865162\n",
       "635808         555066     10756526\n",
       "635809         555066     10865162\n",
       "\n",
       "[635810 rows x 2 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>customer_code</th>\n",
       "      <th>sku_id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>241</td>\n",
       "      <td>10769880</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>241</td>\n",
       "      <td>10713430</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>241</td>\n",
       "      <td>10916001</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>241</td>\n",
       "      <td>DEC85280353</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>241</td>\n",
       "      <td>10769876</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>635805</th>\n",
       "      <td>554523</td>\n",
       "      <td>12191818</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>635806</th>\n",
       "      <td>555066</td>\n",
       "      <td>10756526</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>635807</th>\n",
       "      <td>555066</td>\n",
       "      <td>10865162</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>635808</th>\n",
       "      <td>555066</td>\n",
       "      <td>10756526</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>635809</th>\n",
       "      <td>555066</td>\n",
       "      <td>10865162</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>635810 rows × 2 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 24
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
